
const dicHeb = { 
    'a' : 'ש', 'A' : 'ש',
    'b': 'נ' , 'B': 'נ' ,
    'c': 'ב' , 'C': 'ב',
    'd': 'ג',    'D': 'ג',
    'e': 'ק',    'E': 'ק',
    'f': 'כ',    'F': 'כ',
    'g': 'ע',    'G': 'ע',
    'h': 'י',    'H': 'י',             
    'i': 'ן',    'I': 'ן',
    'j': 'ח',    'J': 'ח',
    'k': 'ל',    'K': 'ל',
    'l': 'ך',    'L': 'ך',
    'm': 'צ',    'M': 'צ',
    'n': 'מ',    'N': 'מ',
    'o': 'ם',    'O': 'ם',
    'p': 'פ',    'P': 'פ',
    'q': '',    'Q': '',
    'r': 'ר',    'R': 'ר',
    's': 'ד',    'S': 'ד',
    't': 'א',    'T': 'א',
    'u': 'ו',    'U': 'ו',
    'v': 'ה',    'V': 'ה',
    'w': '',    'W': '',
    'x': 'ס',    'X': 'ס',
    'y': 'ט',    'Y': 'ט',
    'z': 'ז',    'Z': 'ז',                
    '.' : 'ץ' ,  ' ': ' ',
    '"': '"',
     '>' : 'ץ' ,
    ';' :'ף' ,
    ',' : 'ת' ,
     '<' : 'ת' ,
     '*' :'*',
      '-' :'-',
      '+' :'+',
    ':' :'ף' 

};

const translate = (term) => {
    const regEx = /^[a-zA-Z,.;:\-'"* ]*$/;
  
    var heb="";
    
      if(regEx.test(term))
      {    
        for(var i=0; i< term.length; i++)    
        {       
          var k = term[i];                
          heb += (dicHeb[k] == null ? ' ' : dicHeb[k]);                              
        }
        console.log('term heb : '+ heb); 
        return heb;     
      }
  
  }


  module.exports = translate;


